GA solution ready in https://github.com/marcosgm/terraform-azure-ad-application/blob/bug14/variables.tf , depends on PR https://github.com/lacework/terraform-azure-ad-application/pull/26

Testing:
```
➜  BROWNFIELD terraform init --upgrade
Upgrading modules...
Downloading /Users/marc/Code/terraform-azure-activity-log for az_activity_log...
- az_activity_log in .terraform/modules/az_activity_log
Downloading /Users/marc/Code/terraform-azure-ad-application for az_activity_log.az_al_ad_application...
- az_activity_log.az_al_ad_application in .terraform/modules/az_activity_log.az_al_ad_application
Downloading /Users/marc/Code/terraform-azure-config for az_config...
- az_config in .terraform/modules/az_config
Downloading /Users/marc/Code/terraform-azure-ad-application for az_config.az_cfg_ad_application...
- az_config.az_cfg_ad_application in .terraform/modules/az_config.az_cfg_ad_application

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/azurerm versions matching "~> 2.28, >= 2.80.0"...
- Finding lacework/lacework versions matching "~> 0.3"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Finding latest version of hashicorp/time...
- Finding hashicorp/azuread versions matching ">= 2.6.0"...
- Using previously-installed lacework/lacework v0.11.0
- Using previously-installed hashicorp/random v3.1.0
- Using previously-installed hashicorp/time v0.7.2
- Using previously-installed hashicorp/azuread v2.6.0
- Using previously-installed hashicorp/azurerm v2.80.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
➜  BROWNFIELD terraform apply
module.az_activity_log.random_id.uniq: Refreshing state... [id=mClnkg]
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Refreshing state... [id=fe984f5c-ad75-4544-8794-22e5e5b054bc]
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0]: Refreshing state... [id=621b5ede-5554-461f-8c83-993aef5d5529]
module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0]: Refreshing state... [id=fe984f5c-ad75-4544-8794-22e5e5b054bc/password/63dbf153-ae25-80bb-32f3-dac64ad90267]
module.az_activity_log.azurerm_resource_group.lacework[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-98296792]
module.az_config.time_sleep.wait_time: Refreshing state... [id=2021-10-08T17:26:13Z]
module.az_config.lacework_integration_azure_cfg.default: Refreshing state... [id=LWINTMAR_AAF00D71EEA3BDFF5A708C109E0066454D7DA3A333EBD14]
module.az_activity_log.azurerm_role_definition.lacework: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/53793205-ec8a-f444-fc84-5b4bf545abfd|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-98296792]
module.az_activity_log.azurerm_storage_account.lacework[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-98296792/providers/Microsoft.Storage/storageAccounts/laceworkstorage98296792]
module.az_config.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/565e31f7-02cb-62fa-9a12-36cac2f6a657]
module.az_activity_log.azurerm_role_assignment.lacework: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-98296792/providers/Microsoft.Authorization/roleAssignments/405c4062-feed-ae49-b458-513be273369b]
module.az_activity_log.azurerm_storage_queue.lacework: Refreshing state... [id=https://laceworkstorage98296792.queue.core.windows.net/lacework-queue-98296792]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/microsoft.insights/logprofiles/lacework-log-profile-98296792]
module.az_activity_log.azurerm_eventgrid_event_subscription.lacework: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-98296792/providers/Microsoft.Storage/storageAccounts/laceworkstorage98296792/providers/Microsoft.EventGrid/eventSubscriptions/lacework-subscription-98296792]
module.az_activity_log.time_sleep.wait_time: Refreshing state... [id=2021-10-08T17:26:58Z]
module.az_activity_log.lacework_integration_azure_al.default: Refreshing state... [id=LWINTMAR_91CFB6BBFA55280377B2368CA75A6C1A24DFBDFE536F484]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0] has been changed
  ~ resource "azuread_application" "lacework" {
      + app_role_ids                   = {}
      + device_only_auth_enabled       = false
      + disabled_by_microsoft          = "<nil>"
      ~ group_membership_claims        = [
          - "",
        ]
        id                             = "fe984f5c-ad75-4544-8794-22e5e5b054bc"
      + oauth2_permission_scope_ids    = {
          + "user_impersonation" = "29213268-5579-49d6-86f0-3c1f9633fe11"
        }
      + oauth2_post_response_required  = false
      + publisher_domain               = "csalab.ca"
        # (8 unchanged attributes hidden)

      ~ api {
          + known_client_applications      = []
          + mapped_claims_enabled          = false
          + requested_access_token_version = 1

            # (1 unchanged block hidden)
        }

      + optional_claims {
        }

      + public_client {
          + redirect_uris = []
        }


      + single_page_application {
          + redirect_uris = []
        }

      ~ web {
            # (1 unchanged attribute hidden)

          ~ implicit_grant {
              + id_token_issuance_enabled     = true
                # (1 unchanged attribute hidden)
            }
        }
        # (4 unchanged blocks hidden)
    }
  # module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0] has been changed
  ~ resource "azuread_service_principal" "lacework" {
      + account_enabled              = true
      + alternative_names            = []
      + app_role_ids                 = {}
      + application_tenant_id        = "13161a1e-0709-44f7-8fc8-1b08c4242047"
        id                           = "621b5ede-5554-461f-8c83-993aef5d5529"
      + notification_email_addresses = []
      + oauth2_permission_scope_ids  = {
          + "user_impersonation" = "29213268-5579-49d6-86f0-3c1f9633fe11"
        }
      + owners                       = []
      + redirect_uris                = []
      + service_principal_names      = []
      + sign_in_audience             = "AzureADMyOrg"
        tags                         = []
      + type                         = "Application"
        # (6 unchanged attributes hidden)

      + features {
          + custom_single_sign_on_app = false
          + enterprise_application    = false
          + gallery_application       = false
          + visible_to_users          = true
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.az_activity_log.module.az_al_ad_application.azuread_directory_role.dir-reader will be created
  + resource "azuread_directory_role" "dir-reader" {
      + description  = (known after apply)
      + display_name = (known after apply)
      + id           = (known after apply)
      + object_id    = (known after apply)
      + template_id  = "88d8e3e3-8f55-4a1e-953a-9b9898b8876b"
    }

  # module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0] will be updated in-place
  ~ resource "azuread_application" "lacework" {
        id                             = "fe984f5c-ad75-4544-8794-22e5e5b054bc"
      + logo_image                     = "iVBORw0KGgoAAAANSUhEUgAAAKwAAAC4CAYAAAB+dgdVAAAMrUlEQVR4nO2db2xb1RmH3+MVJRUQElCjpCJAkAO4iSI1FUgLsrSySmVUYn9YJ9AmTdB10oo0lWlD+zSkThsfNkY/IFVD6zQmOuimdLQiIUWtIyhztKI4a2kwKFFd6iBbSdWkBkSyQe907vV1HNd27vH9d869v+dLq7RxrnMfnft7zznvMYvc/yQRURs1Nbdqg19/XmvvGCAAJIFdWTzPUslnaS53mogWuLBt1N5539Xv7RqlpmbcJyAlbPTIr9hU6oUIv7ir3/w+ZAVSo219aB+1tPVE+OhKLa24W0BumppJ64k9GtGamttwq4ASbOgciOBOAVXQbmq9E8ICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICNSgsEptIPrsOtwtIzfISsVTyL2wiuY+WlxYhLJAWlho/ypInn+Ki8nO1+HVCWCAdbCZ9lo2N7KbCwrQpqgmEBfIwm8myZOJpls0crxTVBMIC/+EF1djwHjaTfrWWqCYQFvgHL6jGRvRjNIvXUFdWgrDAFyoqfyuimkBY4ClsavItNjb8uKioJhAWeMNsJht548h3q1X+IkBY4C4WKn8RICxwB175JxNmQWVbVBMIC5yFF1TjiefZRPLXxdd1TFaCsMAxbFT+IkBYYBu98k8mnrZbUFkBwoLGcajyFwHCAnHm80t8LtWpyl8ECAus41LlLwKEBWtjFlTJxM+K/9cXWQnCgrVg4wnXK38RICyoipeVvwgQFqyGV/58t3/x495l++1AWGDAC6rRocf8qPxFgLBhZ3XlTzLLShA2xHi0lOo0EDaEVGufVgUIGyJkrfxFgLBhwOFN1H4CYYOMIpW/CBA2iDTQPq0KEDZIKFr5iwBhA4Ld9mlVgLCKU+/gtAARp6bmFq2rexDCqkqAKv8axPmXtd6Bxyga26ZFYz00m8lDWNUQODhNQQxJu7oHqXdgpxaNbaGm5lXvAsKqgsvt0z4Tp5a227Utg09o0dhWammteTUQVnaCW/kbubRv4FGtd2AnbehosvJNEFZigrCUWsG1uVQQCCsjPrRPu8iauVQECCsTwar8jVzat3mn1jvwcL1cKgKElQEJ2qcdwsil0U07eAFlNZeKAGH9RKL2aRsYj/xo7MHiI184l4oAYX1CtvZpQXRJqb2zTxsY3GU3l4oAYT1G8crflVwqAoT1Csnbp+vgei4VAcK6jY8Hp9lgJZdGN23XejdvkeXCIKxbqFf5r+RSXjz1bt7qVS4VAcI6jXqVv5FLe2LbtYHBH/iRS0WAsA6iUPv0Si7t2/xturW7Q4JrsgSEdQBFKn9pc6kIENYO8i+lKpFLRYCwjSB/+7RSuVQECCuC3AenlXJpo1v3VADCWkHeTdSrc6mHS6R+AWHXQNL26Xgpl67RUhI0IGwNJGyfXsmlAi0lQQPCViJX5R+KXCoChDWRp306dLlUBAgrz8Fplludw0x4hZWj8m+o1TnMhFJYnyt/263OYSZcwvrXPu1oq3OYCYew/lX+yKUOE2xh/dlEjVzqIsEU1vuD0zxtdQ4zwRLW28rft1bnMBMYYT3cRO17q3OYUV9Yb9qnpWp1DitsLp9WV1j326eRS2Vj+fNP1rG53L81lS7a3cofuVRy1hWLE/lxt30auVQFspmkEpHApYPTlG11DjOGsIVFknFUcaHyD0Src1hhc7lzRWEXstTS2iXN78HZpdTAtTqHluWlAhd2gS0tLWhE/gvrbPt0YFudQ8lsJk+lSDCfS1E01u/b78G59mnk0oDCrix+TESnDGGvLJ735W06s5SKXBoG5nNpWim69KLGUxw4OC2OXBoi5nLnyBSWZ0avFg9sVv5odQ4pLJtJ0qq9BG5PbTVe+aPVOewUCy4qF5bN5c5qLa3OF16NtU+j1RmU4JteeMFFZcIu0GzmpKMzBY21T4f2CB5Qh+z5cfMfVyKBsT3PPuKVP3IpqAubSY+a/74SCRwovATap9HqDKxRll+pcgM3PwBNayAWWDw4Da3OQBg2kz5h5leqEFY8x1qr/NHqDBqGTaePl3/v6hF2Ov2q9rWHnlrzxdfeRI1WZ2Cf+fwyFRY+Kn+d1fth+SN9Pr9EGzqqP6vrt08jlwJHYVOpf5THAarShLjAplIHrhlla1f+yKXANSrjAFXrmq2MBTWWUpFLgbvw2YGKOEBV27y5mLOZLP9rxcFpaHUGnsHOTf6zMg5QjXMJFiKHD95W/Dt/5Peh1Rl4Co+gU6lXqv3IasKi1Rn4CpuaHKv186t2zV7d/fO3kUuBX7CJ5J+rxQFOpOo1FRbyVb8OgMuwmfR0tWKrnrCnWDKxHzcG+EIqebDW6Eq1Rlh9d3dBjQNhQICYzeTNzoJaVI8EXNpk4gBcAF5SfLLXHF2pjrCn9GkFjLLAKyyMrlRvhCWMssBDrIyutIawxijLd8wA4CYWR9e1hDWkHRt+BjcLuElkbGSfldGVLAhrzBhUtCkA4BRsanLCPCTDEWG5+ZE3jvwCdwg4jt5ZrT/BLY2uZFFYvvL1ERtPHMMdA07CxhMv8yM0RV7SmrA8y04kX8Q0F3CM+fyy7pTA6EoCwuqHybLRoV/ijgEnEI0CJtaF5aNsNpNkqfGaW78AsAJ3yOo0lh1hydgYc/I5RAPQMHrH9cnnGhldqQFhEQ2ALXR3BAutcr7CbrtP9HsussJihJrX30GdXd24fcAqfKaJTU0ebnR0pYZGWANjBQzLtsAqfFYgmfi9HVnJhrCkLyiMDvEj33HPQH2Wlyjy2qEf2ZWVbAqrnzvPxkawowvURXekTtuLCI1k2HIusvlcAXkW1ILvFWDj9qOAib0R1gB5FlSH51YeGx2SlRwSlvQ8e/hPj2B+FpTguZU74aCs5KCw+vxs5OihPSjCACfy94N77My31sJuhi3nIn326Xq6PJ+je/rjuGvhhY0eOcAuTCecHl3JYWFJL8IuX/ofFRaXKBq718kXBmqgLw6kxHdhWcVpYak0c8DoFurqvtuNiwZyos8IjI00tAvLKm4IS7q02czHdFNbP7V3bnTlyoFU8COG2PDhPW7KSi4KS7q0M+k0pA0B8/nlyNFDT9CXX5xw+826KSxB2hDAZeXTV8tLw168WbeFJUgbYDyWlTwSliBtAPFBVvJQWIK0AcInWcljYQnSBgAfZSUfhCVIqzA+y0o+CUslabEtUR0kkJV8FJZ0aS9Mn8cyrvzwRQF9ntVnWclnYam0jDufy1H3XXFaV/VDbYCP6MutfAXLg0UBK/gtLJkbZtiF6Xe1e/p3QFp50DeyuLw3QBQZhCVzayI7c3pI677rEbr+BljrM/oWQRd3XTWKLMKSLu2XX0yzD85O0vU33o0ZBJ/gnQKv/HGPW/tZ7SKTsAZcWj6D8N+l6+iOnn4ZLik08JmAv77wLSosZmWUlaQU1uAiy2Uv0WzmQ4pu2oZc6z68uIq8fvgnxZmAi7Jep6zCknkkkp5rN3Y9QC1tN0hwTYFEz6u8FVuSmYB6yCwslXLt1ORpdDC4QGFRbxaUNa9WQ3ZhTYwOBh4Ruu7cho/Dt4++GDD00g9lzqvVUEVYKkWEqdQQ3bzhXrp5wy0SXJN68A/COHHsADv15m+KEUDavFoNlYSlUkT48L3/YHWsAfT9AAcfZ7OZd1QaVctRTVgTY3XszGmMthbhq1bFWYDXVRtVy1FVWMJoaxE+qh556afsg/deU3VULUdlYU1WRluskK3As+o7b74cGR3aS599OqTyqFpOEISl0mjLV8j4TEL7xniY9yMY2wH/tlel6SqrBEVYEz6T8C925vRb+tJuZ1d/qGIC/4SW0aHfsvHEH1TPqrUImrAm+tKuHhPWXdcZ+K4G/vh/9+1jkaOHdrPLl2aCNqqWwyL3PynP1bhDnFrabr/6je/8jm7t7gjamzPOsxp+pni0ZWBFNQmDsCZxrat7UBt8YG8QxNXPshob2Vf87IDAi2oSJmFN1BZ3NpNnycT+4kdfhkZUkzAKa6KUuHxEpVTyYFhFNQmzsCZxau/s0wYGd2m9m7fIcUkr6Bk1mdgftkd/LSDsCnFqam7Rtgz+WOsdeJhaWv27Ej49NZU6xiaSL4almLIKhL0W/fMZtGjsQYpu2u7lqMtHU5p5/zibSY8WvwRRK4Cw9TFG3eimHRSNbdOisR6nf4CeTWfSJ9jM+8MYTdcGwlrHkLere5C67vyq/ueGjibhV+GP+2zGGEl5AQVJhYCwjWMI3N7ZR1zepvU3au0dscpXY3P5NC1//gllM0k2lztX9tlVkFQUIvo/tEt7gsI7E2UAAAAASUVORK5CYII="
      + logo_url                       = (known after apply)
      + marketing_url                  = "https://www.lacework.com/"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "29213268-5579-49d6-86f0-3c1f9633fe11"
        } -> (known after apply)
      ~ owners                         = [
          + "2b09d7c3-741e-4975-99c3-f37b9de2564a",
        ]
        # (13 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access lacework_security_audit on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access lacework_security_audit" -> null
              - enabled                    = true -> null
              - id                         = "29213268-5579-49d6-86f0-3c1f9633fe11" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access lacework_security_audit on your behalf." -> null
              - user_consent_display_name  = "Access lacework_security_audit" -> null
              - value                      = "user_impersonation" -> null
            }
        }



      - required_resource_access {
          - resource_app_id = "e406a681-f3d4-42a8-90b6-c2b029497af1" -> null

          - resource_access {
              - id   = "03e0da56-190b-40ad-a80c-ea378c433f7f" -> null
              - type = "Scope" -> null
            }
        }
      - required_resource_access {
          - resource_app_id = "00000002-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "5778995a-e1bf-45b8-affa-663a9f3f4d04" -> null
              - type = "Role" -> null
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d" -> null
              - type = "Scope" -> null
            }
          - resource_access {
              - id   = "df021288-bdef-4463-88db-98f22de89214" -> null
              - type = "Role" -> null
            }
        }
      - required_resource_access {
          - resource_app_id = "cfa8b339-82a2-471a-a3c9-0fc0be7a4093" -> null

          - resource_access {
              - id   = "f53da476-18e3-4152-8e01-aec403e6edc0" -> null
              - type = "Scope" -> null
            }
        }


      ~ web {
          + homepage_url  = "https://www.lacework.com"
            # (1 unchanged attribute hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # module.az_config.module.az_cfg_ad_application.azuread_directory_role.dir-reader will be created
  + resource "azuread_directory_role" "dir-reader" {
      + description  = (known after apply)
      + display_name = (known after apply)
      + id           = (known after apply)
      + object_id    = (known after apply)
      + template_id  = "88d8e3e3-8f55-4a1e-953a-9b9898b8876b"
    }

  # module.az_config.module.az_cfg_ad_application.azuread_directory_role_member.lacework-dir-reader[0] will be created
  + resource "azuread_directory_role_member" "lacework-dir-reader" {
      + id               = (known after apply)
      + member_object_id = "621b5ede-5554-461f-8c83-993aef5d5529"
      + role_object_id   = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.az_activity_log.module.az_al_ad_application.azuread_directory_role.dir-reader: Creating...
module.az_config.module.az_cfg_ad_application.azuread_directory_role.dir-reader: Creating...
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Modifying... [id=fe984f5c-ad75-4544-8794-22e5e5b054bc]
module.az_config.module.az_cfg_ad_application.azuread_directory_role.dir-reader: Creation complete after 1s [id=e95def2f-62ef-4a21-9ee9-1e1cc644c08e]
module.az_activity_log.module.az_al_ad_application.azuread_directory_role.dir-reader: Creation complete after 1s [id=e95def2f-62ef-4a21-9ee9-1e1cc644c08e]
module.az_config.module.az_cfg_ad_application.azuread_directory_role_member.lacework-dir-reader[0]: Creating...
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Modifications complete after 3s [id=fe984f5c-ad75-4544-8794-22e5e5b054bc]
module.az_config.module.az_cfg_ad_application.azuread_directory_role_member.lacework-dir-reader[0]: Creation complete after 3s [id=e95def2f-62ef-4a21-9ee9-1e1cc644c08e/member/621b5ede-5554-461f-8c83-993aef5d5529]

Apply complete! Resources: 3 added, 1 changed, 0 destroyed.
```